load-tests/artillery.yaml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 50
scenarios:
  - name: 'Simulate 1000 emergency triggers'
    flow:
      - post:
          url: '/api/radio/alert'
          json:
            incidentType: 'intrusion'
            timestamp: '{{ $timestamp }}'